app/views/OWS/Reservation/CancelBooking.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soap:Header>
		<OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
        	<Origin entityID="{hotelCode}" systemType="WEB"/>
         	<Destination entityID="{hotelCode}" systemType="PMS"/>
      	</OGHeader>
	</soap:Header>
	<soap:Body>
		<CancelBookingRequest xmlns:hc="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:c="http://webservices.micros.com/og/4.3/Common/" xmlns="http://webservices.micros.com/ows/5.1/Reservation.wsdl">
			<HotelReference chainCode="{chainCode}" hotelCode="{hotelCode}"/>
			<ConfirmationNumber type="INTERNAL">{ConfirmationNumber}</ConfirmationNumber>
			<CancelTerm cancelType="Cancel" cancelReasonCode="PC">
				<hc:CancelReason>
					<hc:Text>{CancelReason}</hc:Text>
				</hc:CancelReason>
			</CancelTerm>
		</CancelBookingRequest>
	</soap:Body>
</soap:Envelope>